# ShowOnlySelected

## Description
Sets the object visibility of all unselected objects to &amp;quot;invisible&amp;quot;. Hidden objects can be made visible with Show or UnHideObjects commands.

```pascal
PROCEDURE ShowOnlySelected;
```

```python

def vs.ShowOnlySelected():
    return None
```

## Examples
```pascal
ShowOnlySelected();
```

## Version
Availability: from Vectorworks 2025
## Category
* Object Attributes